# Analytical Procedures - SQL Queries

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
## Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:5ho7gvcd@f19server.apan5310.com:50204/brooklyn_home'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

### Passing the SQL Statements for the analytical procedures developed

#### Query 1

In [4]:
#What date of every month in 2017 has closed the most frequent property sales?

stmt1 = """
        WITH daily_sales AS (
        SELECT
        COUNT(sale_id) as num_sales,
        sale_date
        FROM property_sales
        GROUP BY sale_date
        ORDER BY num_sales DESC
        ),
        sales_ranked AS(
        SELECT 
        MAX(num_sales) as max_sales,
        RANK() OVER (PARTITION BY EXTRACT(MONTH FROM sale_date) ORDER BY num_sales DESC) as max_sales_rank,
        sale_date
        FROM daily_sales
        GROUP BY num_sales, sale_date)
        
        SELECT
        max_sales as num_sales,
        sale_date
        FROM sales_ranked
        WHERE max_sales_rank = 1;
"""

# Execute the statement and get the results
results = connection.execute(stmt1).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

    num_sales   sale_date
0         117  2017-01-12
1         151  2017-02-28
2         138  2017-03-30
3         131  2017-04-27
4         139  2017-05-25
5         176  2017-06-30
6         135  2017-07-25
7         128  2017-08-03
8         121  2017-09-28
9         113  2017-10-31
10        123  2017-11-21
11        111  2017-12-01

#### Query 2

In [5]:
#What is the average square footage of properties sold in the top 10 selling neighborhoods?

stmt2 = """
        SELECT neighborhood, rank, avg_sqft
        FROM
        (SELECT 
         p.neighborhood_id, 
         RANK() OVER (ORDER BY COUNT(*) DESC) AS rank,
         ROUND(AVG(s.gross_sqft),2) as avg_sqft
         FROM property_sales s 
         JOIN properties p 
         ON s.property_id = p.property_id
         GROUP BY p.neighborhood_id) a
        JOIN
        neighborhoods n
        ON a.neighborhood_id = n.neighborhood_id
        WHERE a.rank<=10
        ORDER BY a.rank;
"""

# Execute the statement and get the results
results = connection.execute(stmt2).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df2 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df2

         neighborhood  rank avg_sqft
0  BEDFORD STUYVESANT     1  2859.88
1        BOROUGH PARK     2  2356.40
2      SHEEPSHEAD BAY     3  3565.45
3       EAST NEW YORK     4  2643.51
4           BAY RIDGE     5  2061.82
5       FLATBUSH-EAST     6  2441.04
6            CANARSIE     7  2271.27
7       CROWN HEIGHTS     8  3314.74
8          PARK SLOPE     9  1389.78
9           GRAVESEND    10  1592.53

#### Query 3

In [6]:
#What are the top 3 months with the highest price of property sales in 2017?

stmt3 = """
       SELECT a.sale_month, a.sale_price
       FROM
        (SELECT 
         EXTRACT(MONTH from sale_date) AS sale_month,
         RANK() OVER (ORDER BY sale_price DESC) as rank,
         sale_price
         FROM property_sales) a
         WHERE rank<=3

"""
# Execute the statement and get the results
results = connection.execute(stmt3).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df3 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df3

   sale_month   sale_price
0        10.0  202500000.0
1        10.0  171000000.0
2         4.0  160000000.0

#### Query 4

In [26]:
#How many properties are sold by neighborhood and month?

stmt4 = """
        SELECT
        N.neighborhood,
        EXTRACT('month' FROM sale_date) as sales_month,
        COUNT(ps.sale_id) as nr_property_sales
        FROM property_sales AS ps
        JOIN properties p ON ps.property_id=p.property_id
        JOIN neighborhoods n ON n.neighborhood_id=p.neighborhood_id
        GROUP BY n.neighborhood_id, sales_month
        ORDER BY sales_month;
"""
# Execute the statement and get the results
results = connection.execute(stmt4).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df4 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df4.head(20)

                neighborhood  sales_month  nr_property_sales
0              CROWN HEIGHTS          1.0                 67
1                    MIDWOOD          1.0                 42
2              EAST NEW YORK          1.0                 72
3            WYCKOFF HEIGHTS          1.0                  6
4           PARK SLOPE SOUTH          1.0                 21
5                  BAY RIDGE          1.0                 80
6   FLATBUSH-LEFFERTS GARDEN          1.0                 12
7                 OCEAN HILL          1.0                 29
8             FLATBUSH-NORTH          1.0                 38
9                COBBLE HILL          1.0                  8
10              CLINTON HILL          1.0                 27
11               BROWNSVILLE          1.0                 21
12             BUSH TERMINAL          1.0                  4
13              BOROUGH PARK          1.0                114
14         WILLIAMSBURG-EAST          1.0                 33
15      DOWNTOWN-FULTON MALL          1.0                 42
16                 GRAVESEND          1.0                 67
17            BRIGHTON BEACH          1.0                 39
18          FLATBUSH-CENTRAL          1.0                 39
19           MANHATTAN BEACH          1.0                  6

#### Query 5

In [8]:
#What are the highest and lowest property selling months?

stmt5="""

SELECT
EXTRACT('month' FROM sale_date) as sale_month,
COUNT(sale_id) AS nr_property_sales
FROM property_sales
GROUP BY sale_month
ORDER BY nr_property_sales DESC;

"""
# Execute the statement and get the results
results = connection.execute(stmt5).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df5 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df5

    sale_month  nr_property_sales
0          6.0               2469
1          8.0               2274
2          3.0               2271
3          5.0               2136
4          1.0               1922
5          7.0               1902
6          9.0               1889
7         11.0               1875
8         10.0               1872
9          2.0               1853
10        12.0               1798
11         4.0               1744

#### Query 6

In [9]:
#What is the median price of sold properties month-to-month?

stmt6="""
        SELECT
        EXTRACT('month' FROM sale_date) AS sale_month,
        ROUND(percentile_disc(0.5) within group (order by sale_price)) AS median_sale_price 
        FROM property_sales
        GROUP BY sale_month
        ORDER BY sale_month;
"""
# Execute the statement and get the results
results = connection.execute(stmt6).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df6 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df6

    sale_month median_sale_price
0          1.0            441761
1          2.0            400000
2          3.0            380000
3          4.0            419666
4          5.0            400000
5          6.0            495000
6          7.0            499000
7          8.0            490000
8          9.0            445018
9         10.0            450000
10        11.0            445000
11        12.0            485000

#### Query 7

In [10]:
#What are the details of the outlier properties sold (i.e properties sold at a very high price)?

stmt7="""
        SELECT n.neighborhood,ROUND(ps.sale_price) property_price, ps.sale_date, ps.gross_sqft  
        FROM property_sales AS ps
        JOIN properties p ON ps.property_id=p.property_id
        JOIN neighborhoods n ON n.neighborhood_id=p.neighborhood_id
        WHERE ps.sale_price>=100000000;
"""

# Execute the statement and get the results
results = connection.execute(stmt7).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df7 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df7

         neighborhood property_price   sale_date gross_sqft
0    BROOKLYN HEIGHTS      202500000  2017-10-31   356000.0
1    BROOKLYN HEIGHTS      171000000  2017-10-10   290440.0
2  WILLIAMSBURG-NORTH      160000000  2017-04-19        0.0
3  DOWNTOWN-METROTECH      138106368  2017-03-31   253096.0
4  DOWNTOWN-METROTECH      135000000  2017-08-29   363100.0
5  DOWNTOWN-METROTECH      121313223  2017-03-31   223712.0
6  DOWNTOWN-METROTECH      102873750  2017-03-31   210488.0

#### Query 8

In [11]:
#Who are the owners of the top 5 sold properties (the ones with the highest price point)?

stmt8="""
        SELECT a.owner_name, a.sale_price
        FROM
        (SELECT ow.owner_name, ps.sale_price, RANK() OVER (ORDER BY ps.sale_price DESC) as rank
        FROM property_sales AS ps
        JOIN owns o ON ps.property_id=o.property_id
        JOIN owners AS ow ON ow.owner_id=o.owner_id
        ORDER BY ps.sale_price DESC) a
        WHERE rank<=5;
"""

# Execute the statement and get the results
results = connection.execute(stmt8).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df8 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df8

              owner_name   sale_price
0  WATCHTOWER C/O REAL P  202500000.0
1  16 COURT STREET OWNER  171000000.0
2        10TH STREET LLC  160000000.0
3  WATCHTOWER C/O REAL P  135000000.0
4  WATCHTOWER C/O REAL P   87500000.0

#### Query 9

In [12]:
#What is the typology of the top 5 neighborhoods with the highest number of property sales? 
#i.e how many school districts, police districts, fire companies do they include?

stmt9="""
        SELECT a.neighborhood, a.nr_property_sales, a.comm_dist, a.council_dist, a.fire_comp, a.police_prec
        FROM
        (SELECT n.neighborhood,
        COUNT(ps.sale_id) as nr_property_sales,
        COUNT(DISTINCT c.community_district_id) comm_dist,
        COUNT(DISTINCT cd.city_council_district_id) council_dist,
        COUNT(DISTINCT f.fire_company_id) fire_comp, 
        COUNT(DISTINCT pp.police_precinct_id) police_prec,
        RANK() OVER (ORDER BY COUNT(ps.sale_id) DESC)
        FROM property_sales AS ps
        JOIN properties p ON ps.property_id=p.property_id
        JOIN neighborhoods n ON n.neighborhood_id=p.neighborhood_id
        JOIN community_districts c ON p.community_district_id=c.community_district_id
        JOIN council_districts cd ON p.city_council_district_id=cd.city_council_district_id
        JOIN fire_companies f ON p.fire_company_id=f.fire_company_id
        JOIN police_precincts pp ON p.police_precinct_id=pp.police_precinct_id
        GROUP BY n.neighborhood_id
        ORDER BY nr_property_sales DESC) a
        WHERE a.rank<=5;
"""

# Execute the statement and get the results
results = connection.execute(stmt9).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df9 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df9

,neighborhood,nr_property_sales,comm_dist,council_dist,fire_comp,police_prec
0,BEDFORD STUYVESANT,840,1,4,8,2
1,BAY RIDGE,601,1,1,2,1
2,BOROUGH PARK,553,3,4,6,3
3,EAST NEW YORK,479,1,2,6,1
4,SHEEPSHEAD BAY,455,1,2,2,1

#### Query 10

In [14]:
#What are the distances (euclidean) between property and fire companies, police districts and school districts?

#a: create function to calculate euclidean distances
stmt10a="""
CREATE OR REPLACE FUNCTION calculate_distance(lat1 float, lon1 float, lat2 float, lon2 float, units varchar)
RETURNS float AS $dist$
 DECLARE
  dist float = 0;
        radlat1 float;
        radlat2 float;
        theta float;
        radtheta float;
    BEGIN
        IF lat1 = lat2 OR lon1 = lon2
            THEN RETURN dist;
        ELSE
            radlat1 = pi() * lat1 / 180;
            radlat2 = pi() * lat2 / 180;
            theta = lon1 - lon2;
            radtheta = pi() * theta / 180;
            dist = sin(radlat1) * sin(radlat2) + cos(radlat1) * cos(radlat2) * cos(radtheta);

            IF dist > 1 THEN dist = 1; END IF;

            dist = acos(dist);
            dist = dist * 180 / pi();
            dist = dist * 60 * 1.1515;

            IF units = 'K' THEN dist = dist * 1.609344; END IF;
            IF units = 'N' THEN dist = dist * 0.8684; END IF;

            RETURN dist;
        END IF;
    END;
$dist$ LANGUAGE plpgsql;

"""
connection.execute(stmt10a)

In [23]:
#b: The euclidean distances between property and fire companies coordinates.

stmt10b="""
        SELECT b.property_id, b.fire_company_id, calculate_distance(lat1,lon1,lat2,lon2,'M') AS eud_distance
        FROM 
        (SELECT p.property_id,f.fire_company_id,f.fire_comp_address_id, a1.lat as lat1, a1.lon as lon1,a.lat as lat2, a.lon as lon2
        FROM fire_companies f JOIN properties p 
        ON f.fire_company_id= p.fire_company_id
        JOIN addresses a on a.address_id=f.fire_comp_address_id
        JOIN addresses a1 on a1.address_id=p.address_id) b
        ORDER BY eud_distance;
"""

# Execute the statement and get the results
results = connection.execute(stmt10b).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df10b = pd.DataFrame(results, columns=column_names)

# Show results
temp_df10b.head(20)

    property_id  fire_company_id  eud_distance
0         19579               54      0.000000
1         15576               53      0.000000
2         21116               49      0.000000
3         14275               53      0.000000
4          6587               53      0.000000
5          4793               52      0.000000
6          5887               41      0.001503
7           843               43      0.002114
8          5886               41      0.002658
9           267                8      0.002887
10        18077                6      0.002962
11         2362               41      0.003253
12          269               12      0.003478
13         2036               27      0.003494
14        17303               41      0.003958
15          209               38      0.004513
16        23341                8      0.004993
17        23278               47      0.005467
18        17700               38      0.007185
19         3718               24      0.007620

In [24]:
#c:The euclidean distances between property and fire companies coordinates

stmt10c="""
        SELECT b.property_id, b.school_district_id, calculate_distance(lat1,lon1,lat2,lon2,'M') AS eud_distance
        FROM 
        (SELECT p.property_id,s.school_district_id,s.school_dist_address_id, a1.lat as lat1, a1.lon as lon1,a.lat as lat2, a.lon as lon2
        FROM school_districts s JOIN properties p 
        ON s.school_district_id= p.school_district_id
        JOIN addresses a on a.address_id=s.school_dist_address_id
        JOIN addresses a1 on a1.address_id=p.address_id) b
        ORDER BY eud_distance;
"""

# Execute the statement and get the results
results = connection.execute(stmt10c).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df10c = pd.DataFrame(results, columns=column_names)

# Show results
temp_df10c.head(20)

    property_id  school_district_id  eud_distance
0         17097                   5      0.000000
1          6208                   5      0.000000
2         19066                  11      0.000000
3         23616                   2      0.000000
4         14065                   4      0.000000
5         10034                   4      0.015611
6         13191                   4      0.015611
7         10656                  10      0.024743
8         16564                  11      0.025068
9         16565                  11      0.025588
10         1139                  11      0.029508
11        16566                  11      0.029832
12        12818                   4      0.031269
13        18485                   4      0.031269
14         2432                  11      0.034077
15        21870                   3      0.040975
16         5169                   4      0.045179
17        19024                   8      0.046689
18        23418                   2      0.047213
19        18477                   4      0.047241

In [25]:
#d: The euclidean distances between property and police district coordinates

stmt10d="""
        SELECT b.property_id, b.police_precinct_id, calculate_distance(lat1,lon1,lat2,lon2,'M') AS eud_distance
        FROM 
        (SELECT p.property_id,pp.police_precinct_id,pp.police_prct_address_id, a1.lat as lat1, a1.lon as lon1,a.lat as lat2, a.lon as lon2
        FROM police_precincts pp JOIN properties p 
        ON pp.police_precinct_id= p.police_precinct_id
        JOIN addresses a on a.address_id=pp.police_prct_address_id
        JOIN addresses a1 on a1.address_id=p.address_id) b
        ORDER BY eud_distance;
"""

# Execute the statement and get the results
results = connection.execute(stmt10d).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df10d = pd.DataFrame(results, columns=column_names)

# Show results
temp_df10d.head(20)

    property_id  police_precinct_id  eud_distance
0          5199                  11      0.000000
1         19221                  15      0.000000
2          4285                  22      0.000000
3          8747                  20      0.001963
4          9258                  22      0.005208
5         19878                  20      0.005767
6         21972                  21      0.006535
7          2824                  12      0.007806
8          3720                  12      0.008455
9          2709                  18      0.011073
10         2141                  17      0.012691
11        15921                  18      0.018635
12        21956                   5      0.021855
13          572                   7      0.022148
14        21933                   5      0.024305
15        23136                   8      0.024654
16         6912                  15      0.024730
17        15138                  14      0.026551
18        21954                   5      0.027742
19        18655                   7      0.029124